In [34]:
# NA(即NaN)处理方法
# dropna： 根据各标签的值中是否存在缺失数据对轴标签进行过滤，可通过阈值调节对缺失值的容忍度
# fillna：   用指定值或插值方法（如fill、bfill）填充缺失数据
# isnull：   返回一个含有布尔值的对象，表示哪些值是缺失值
# notnull：  isnull的否定式

In [35]:
# 对应一个Series，dropna返回一个仅含非空数据和索引值的Series
from numpy import nan as NA

data = Series([1,NA,3.5,NA,6])
data.dropna()

0    1.0
2    3.5
4    6.0
dtype: float64

In [36]:
# 也可以通过布尔型索引
data[data.notnull()]

0    1.0
2    3.5
4    6.0
dtype: float64

In [37]:
# 而对于DataFrame对象，默认是丢弃任何含有缺失值的行
data = DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [38]:
# 传入how='all'只丢弃全为NA的那些行
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [39]:
data[4]=NA
data
data['a'] = NA
data

     0    1    2   4   a
0  1.0  6.5  3.0 NaN NaN
1  1.0  NaN  NaN NaN NaN
2  NaN  NaN  NaN NaN NaN
3  NaN  6.5  3.0 NaN NaN

In [40]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [46]:
import numpy as np
df= DataFrame(np.random.randn(7,3))
df.loc[:4, 1] = NA;df.loc[:2,2] = NA
df

          0         1         2
0 -0.546386       NaN       NaN
1  0.586664       NaN       NaN
2 -1.553883       NaN       NaN
3  0.038997       NaN -1.334256
4  0.860446       NaN  0.938247
5  1.060793  2.086599  1.691221
6  1.574867 -0.278350  2.152284

In [48]:
df.fillna(0)

          0         1         2
0 -0.546386  0.000000  0.000000
1  0.586664  0.000000  0.000000
2 -1.553883  0.000000  0.000000
3  0.038997  0.000000 -1.334256
4  0.860446  0.000000  0.938247
5  1.060793  2.086599  1.691221
6  1.574867 -0.278350  2.152284

In [50]:
df.fillna({1:0.5, 3:-1})

          0         1         2
0 -0.546386  0.500000       NaN
1  0.586664  0.500000       NaN
2 -1.553883  0.500000       NaN
3  0.038997  0.500000 -1.334256
4  0.860446  0.500000  0.938247
5  1.060793  2.086599  1.691221
6  1.574867 -0.278350  2.152284